certora/mutations/006_flow_prelock_bypass.patch
diff --git a/contracts/vault/VaultBase.sol b/contracts/vault/VaultBase.sol
index be21481..22deafc 100644
--- a/contracts/vault/VaultBase.sol
+++ b/contracts/vault/VaultBase.sol
@@ -189,7 +189,7 @@ abstract contract VaultBase {
     TokensPerSecond rate
   ) internal {
     Fund memory fund = _funds[controller][fundId];
-    require(fund.status() == FundStatus.Locked, VaultFundNotLocked());
+    require(fund.status() == FundStatus.Locked || fund.status() == FundStatus.Inactive, VaultFundNotLocked());
 
     Account memory sender = _accounts[controller][fundId][from];
     sender.flowOut(rate);
