certora/mutations/011_withdraw_reentrancy_ordering.patch
diff --git a/contracts/vault/VaultBase.sol b/contracts/vault/VaultBase.sol
index be21481..ddfaad7 100644
--- a/contracts/vault/VaultBase.sol
+++ b/contracts/vault/VaultBase.sol
@@ -254,10 +254,10 @@ abstract contract VaultBase {
     account.accumulateFlows(fund.flowEnd());
     uint128 amount = account.balance.available + account.balance.designated;
 
-    delete _accounts[controller][fundId][accountId];
-
     (address owner, ) = Accounts.decodeId(accountId);
     _token.safeTransfer(owner, amount);
+
+    delete _accounts[controller][fundId][accountId];
   }
 
   function _checkLockInvariant(Fund memory fund) private pure {
