certora/mutations/016_pause_functions_deleted.patch
diff --git a/contracts/Vault.sol b/contracts/Vault.sol
index 8433a08..185ed83 100644
--- a/contracts/Vault.sol
+++ b/contracts/Vault.sol
@@ -240,13 +240,7 @@ contract Vault is VaultBase, Pausable, Ownable {
     _withdraw(controller, fund, accountId);
   }
 
-  function pause() public onlyOwner {
-    _pause();
-  }
 
-  function unpause() public onlyOwner {
-    _unpause();
-  }
 
   error VaultOnlyAccountHolder();
 }
