certora/mutations/023_flow_pause_bypass.patch
diff --git a/contracts/Vault.sol b/contracts/Vault.sol
index 8433a08..52b7db0 100644
--- a/contracts/Vault.sol
+++ b/contracts/Vault.sol
@@ -180,7 +180,7 @@ contract Vault is VaultBase, Pausable, Ownable {
     AccountId from,
     AccountId to,
     TokensPerSecond rate
-  ) public whenNotPaused {
+  ) public {
     Controller controller = Controller.wrap(msg.sender);
     _flow(controller, fundId, from, to, rate);
   }
