certora/mutations/027_burnDesignated_pause_bypass.patch
diff --git a/contracts/Vault.sol b/contracts/Vault.sol
index 8433a08..c9b39f2 100644
--- a/contracts/Vault.sol
+++ b/contracts/Vault.sol
@@ -191,7 +191,7 @@ contract Vault is VaultBase, Pausable, Ownable {
     FundId fundId,
     AccountId accountId,
     uint128 amount
-  ) public whenNotPaused {
+  ) public {
     Controller controller = Controller.wrap(msg.sender);
     _burnDesignated(controller, fundId, accountId, amount);
   }
