certora/mutations/028_burnAccount_pause_bypass.patch
diff --git a/contracts/Vault.sol b/contracts/Vault.sol
index 8433a08..de9c8d2 100644
--- a/contracts/Vault.sol
+++ b/contracts/Vault.sol
@@ -202,7 +202,7 @@ contract Vault is VaultBase, Pausable, Ownable {
   function burnAccount(
     FundId fundId,
     AccountId accountId
-  ) public whenNotPaused {
+  ) public {
     Controller controller = Controller.wrap(msg.sender);
     _burnAccount(controller, fundId, accountId);
   }
